package HW1;

public class HW1_1_2 {

    //    1.	Создать пустой проект в IntelliJ IDEA и прописать метод main().
    public static void main(String[] args) {
        System.out.println("1. Метод main создан");

//    2.	Создать переменные всех пройденных типов данных и инициализировать их значения.
        System.out.println("2. Создание и инициализация переменных:");
        byte Obyte = 1;
        short Oshort = 2;
        int Oint = 4;
        long Olong = 8;
        float Ofloat = 0.15f;
        double Odouble = 0.5598;
        boolean Oboolean = true;
        String Ostring = "Привет";
        System.out.println("Значение переменной byte: " + Obyte);
        System.out.println("Значение переменной short: " + Oshort);
        System.out.println("Значение переменной int: " + Oint);
        System.out.println("Значение переменной long: " + Olong);
        System.out.println("Значение переменной float: " + Ofloat);
        System.out.println("Значение переменной double: " + Odouble);
        System.out.println("Значение переменной boolean: " + Oboolean);
        System.out.println("Значение переменной string: " + Ostring);


    }
}
